Revit 2024 API
Asset.Title Property
 Asset title
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Title { get; }
Visual Basic
Public ReadOnly Property Title As String
	Get
Visual C++
public:
property String^ Title {
	String^ get ();
}
See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace